load-test.yml
# This YAML file defines a load test configuration for the Artillery tool. The test targets a local server running on port 3000 and 
# simulates a scenario where 15 requests per second are sent to the "/api/book/1" endpoint for a duration of 20 seconds. 
# This is useful for testing the performance and stability of the booking API under load conditions.
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 15

scenarios:
  - flow:
      - post:
          url: "/api/book/1"

# Response validation is included to ensure that the API is returning the expected status code (200) for successful bookings.
# The test will also collect various metrics such as response times, request rates, and the number of successful and failed requests,
# which can be used to analyze the performance of the API under load.

# codes.200 is 1 means that out of all the requests sent during the test, only 1 request received a successful response with a status code of 200.
# codes.400 is 124 means that 124 requests received a client error response with a status code of 400, which typically indicates that the 
# request was malformed or invalid in some way, which in our case could be due to trying to book a seat that is already booked.
# codes.423 is 4 means that 4 requests received a locked response with a status code of 423, which indicates that the resource is currently locked.

# http.codes.200: ................................................................ 1
# http.codes.400: ................................................................ 124
# http.codes.423: ................................................................ 4
# http.downloaded_bytes: ......................................................... 4457
# http.request_rate: ............................................................. 15/sec
# http.requests: ................................................................. 129
# http.response_time:
#   min: ......................................................................... 2
#   max: ......................................................................... 75
#   mean: ........................................................................ 7.7
#   median: ...................................................................... 7
#   p95: ......................................................................... 10.1
#   p99: ......................................................................... 19.1
# http.response_time.2xx:
#   min: ......................................................................... 44
#   max: ......................................................................... 44
#   mean: ........................................................................ 44
#   median: ...................................................................... 44.3
#   p95: ......................................................................... 44.3
#   p99: ......................................................................... 44.3
# http.response_time.4xx:
#   min: ......................................................................... 2
#   max: ......................................................................... 75
#   mean: ........................................................................ 7.4
#   median: ...................................................................... 7
#   p95: ......................................................................... 10.1
#   p99: ......................................................................... 12.1
# http.responses: ................................................................ 129
# vusers.completed: .............................................................. 129
# vusers.created: ................................................................ 129
# vusers.created_by_name.0: ...................................................... 129
# vusers.failed: ................................................................. 0
# vusers.session_length:
#   min: ......................................................................... 5.3
#   max: ......................................................................... 94.8
#   mean: ........................................................................ 14.9
#   median: ...................................................................... 12.3
#   p95: ......................................................................... 26.8
#   p99: ......................................................................... 37


# Phase completed: unnamed (index: 0, duration: 20s) 16:04:10(+0530)

# --------------------------------------
# Metrics for period to: 16:04:10(+0530) (width: 9.951s)
# --------------------------------------

# http.codes.400: ................................................................ 148
# http.codes.423: ................................................................ 2
# http.downloaded_bytes: ......................................................... 5132
# http.request_rate: ............................................................. 15/sec
# http.requests: ................................................................. 150
# http.response_time:
#   min: ......................................................................... 1
#   max: ......................................................................... 11
#   mean: ........................................................................ 5.5
#   median: ...................................................................... 5
#   p95: ......................................................................... 8.9
#   p99: ......................................................................... 10.1
# http.response_time.4xx:
#   min: ......................................................................... 1
#   max: ......................................................................... 11
#   mean: ........................................................................ 5.5
#   median: ...................................................................... 5
#   p95: ......................................................................... 8.9
#   p99: ......................................................................... 10.1
# http.responses: ................................................................ 150
# vusers.completed: .............................................................. 150
# vusers.created: ................................................................ 150
# vusers.created_by_name.0: ...................................................... 150
# vusers.failed: ................................................................. 0
# vusers.session_length:
#   min: ......................................................................... 4.4
#   max: ......................................................................... 49.8
#   mean: ........................................................................ 9.8
#   median: ...................................................................... 8.9
#   p95: ......................................................................... 15
#   p99: ......................................................................... 18.7


# --------------------------------------
# Metrics for period to: 16:04:20(+0530) (width: 1.32s)
# --------------------------------------

# http.codes.400: ................................................................ 21
# http.downloaded_bytes: ......................................................... 714
# http.request_rate: ............................................................. 21/sec
# http.requests: ................................................................. 21
# http.response_time:
#   min: ......................................................................... 4
#   max: ......................................................................... 12
#   mean: ........................................................................ 6.8
#   median: ...................................................................... 7
#   p95: ......................................................................... 10.1
#   p99: ......................................................................... 10.1
# http.response_time.4xx:
#   min: ......................................................................... 4
#   max: ......................................................................... 12
#   mean: ........................................................................ 6.8
#   median: ...................................................................... 7
#   p95: ......................................................................... 10.1
#   p99: ......................................................................... 10.1
# http.responses: ................................................................ 21
# vusers.completed: .............................................................. 21
# vusers.created: ................................................................ 21
# vusers.created_by_name.0: ...................................................... 21
# vusers.failed: ................................................................. 0
# vusers.session_length:
#   min: ......................................................................... 7.6
#   max: ......................................................................... 18.3
#   mean: ........................................................................ 11.3
#   median: ...................................................................... 10.9
#   p95: ......................................................................... 17.3
#   p99: ......................................................................... 17.3


# All VUs finished. Total time: 22 seconds

# --------------------------------
# Summary report @ 16:04:13(+0530)
# --------------------------------

# http.codes.200: ................................................................ 1
# http.codes.400: ................................................................ 293
# http.codes.423: ................................................................ 6
# http.downloaded_bytes: ......................................................... 10303
# http.request_rate: ............................................................. 15/sec
# http.requests: ................................................................. 300
# http.response_time:
#   min: ......................................................................... 1
#   max: ......................................................................... 75
#   mean: ........................................................................ 6.5
#   median: ...................................................................... 6
#   p95: ......................................................................... 10.1
#   p99: ......................................................................... 12.1
# http.response_time.2xx:
#   min: ......................................................................... 44
#   max: ......................................................................... 44
#   mean: ........................................................................ 44
#   median: ...................................................................... 44.3
#   p95: ......................................................................... 44.3
#   p99: ......................................................................... 44.3
# http.response_time.4xx:
#   min: ......................................................................... 1
#   max: ......................................................................... 75
#   mean: ........................................................................ 6.4
#   median: ...................................................................... 6
#   p95: ......................................................................... 10.1
#   p99: ......................................................................... 12.1
# http.responses: ................................................................ 300
# vusers.completed: .............................................................. 300
# vusers.created: ................................................................ 300
# vusers.created_by_name.0: ...................................................... 300
# vusers.failed: ................................................................. 0
# vusers.session_length:
#   min: ......................................................................... 4.4
#   max: ......................................................................... 94.8
#   mean: ........................................................................ 12.1
#   median: ...................................................................... 10.3
#   p95: ......................................................................... 22
#   p99: ......................................................................... 37